"""
Дано натуральное число. Выведите его последнюю цифру.
"""

var = int(input())
print(var % 10)