"""
Дано положительное действительное число X. Выведите его дробную часть.
Формат ввода

Вводятся положительное действительное число.
"""
var = float(input())

x = var - int(var)

print(x)