"""
Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Гарантируется, что в строке не встречается несколько пробелов подряд.

Ввод
Hello world

Вывод
2
"""

var = input()

print(len(var.split(" ")))