"""
Дана строка. Замените в этой строке все цифры 1 на слово one.
Формат ввода

Вводится строка.
Формат вывода

Выведите ответ на задачу.
Пример 1
Ввод
Вывод

1+1=2
one+one=2
"""

var = input()

print(var.replace("1", "one"))